{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "batch_input_shape": [null, 784], "bias_constraint": null, "trainable": true, "activation": "linear", "units": 100, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "units": 500, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "units": 250, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_3"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "units": 10, "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_4"}}]}, "backend": "tensorflow", "keras_version": "2.2.4"}